# -*- coding: utf-8 -*-
"""hwAB.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1joAgkr_fjXoINOEWseQLWwTlfyOPRbCE

# Домашнее задание по теме «Построение гипотез. A/B тестирование. Автотестирование гипотез»

## Формулировка задания:
Подготовка к проведению A/B тестирования гипотезы

Для выполнения задания выполнить следующие шаги:
1. Найти данные для анализа (таблица csv, xlsx в открытом доступе)
2. Изучить данные (тема, типы столбцов, есть ли зависимость между столбцами)
3. Составить список гипотез по данным. Предположения :
- Зависимость столбцов по датам, времени и другим
критериям;
- Численный показатель или критерий оценки;
- Насколько есть разница в данных по выбранному
числовому критериям оценки
4. Выбрать одну из гипотез и подтвердить её или опровергнуть.
5. (Дополнительно) В качестве критериев выбрать статистические критерии. Например, критерий Стьюдента и др.

## Ожидаемый результат:
1. Файл с исходными данными;
2. Создан список гипотез по данным (примеры гипотез ниже);
3. Проверка гипотезы
4. Результат по гипотезе - подтверждение, опровержение и вывод
5. Расчеты в MS Excel, Colab/Jupiter notebook или python файл с проверкой выбранной гипотезы
6. (Дополнительно) Указан критерий проверки выбранной гипотезы;

## Примеры гипотез в области промышленности для проведения A/B тестирования
1. Добавление функции автоматической проверки качества на стадии производства увеличит производительность на 10%.
2. Оптимизация процесса производства с использованием роботизированных систем снизит затраты на 10%.
3. Обновление системы управления производством увеличит качество продукции на 20%.
4. Использование интеллектуальной системы принятия решений повысит производительность на 15%.
5. Увеличение доли устройств для автоматизации процессов производства повысит производительность на 20%.
6. Увеличение инвестиций в инструменты контроля качества продукции увеличит производительность на 25%.
7. Отказ от традиционных способов производства и переход на современные технологии увеличит качество продукции на 30%.
8. Использование машинного обучения и искусственного интеллекта для анализа данных повысит производительность на 15%.
9. Создание интегрированной системы управления снизит затраты на производство на 10%.
10. Использование программно-аппаратных средств для автоматической обработки данных увеличит производительность на 20%.

## Перечень инструментов, необходимых для реализации деятельности:
1) MS Excel

2) Colab/Jupiter notebook

3) PyCharm

## Релизация

[Выбранный dataset для анализа](https://www.kaggle.com/datasets/beaver68/cars-dataset-in-russia)
"""

# подключение библиотек
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import scipy
from scipy import stats

# загрузка данных
df = pd.read_csv('/content/sample_data/california_housing_test.csv')
df.head()

# посмотрим информацию по выборке
df.describe(include = 'all')

# проверим на пропуски
df.isnull().sum()

"""### Датасет содержит информацию:
```markdown
Заголовок           | Название
--------------------|------------------------
longitude           | долгота
latitude            | широта
housing median age  | средний возраст жилья
total rooms         | всего комнат
total bedrooms      | всего спален
population          | население
households          | домохозяйства
median income       | средний доход
median house value  | средняя стоимость дома

```
### Исходя из данных датасета мы можем рассмотреть следующие вопросы:


1.   Существует ли положительная корреляция между средней стоимостью дома и среднем доходом
2.   Наблюдается ли зависимость между численностью населения и среднем возрастом жилья


"""

# потстроим матрицу корреляций
matrix_corr = df.corr();

# вывод корреляционной матрицы
sns.heatmap(matrix_corr, annot=True, cmap='coolwarm');

# рассмотрим диаграмму средней стоимости дома
fig = plt.subplots()
sns.countplot( x='median_house_value', data=df)
plt.show()

# из графика видим что анамально много записей относится к одной стоимости, выведем данные ко количеству с группировкой по нужному нам полю
df.groupby('median_house_value').count()

# видим что к стоимости 500001 относится очень много записей, предполагаю что к этой записи относятся все дома что дороже 500000. Для корректного анализа удалим эти записи
df = df.loc[df['median_house_value'] != 500001]
df

# повторно потстроим матрицу корреляций
matrix_corr = df.corr();

# вывод корреляционной матрицы
sns.heatmap(matrix_corr, annot=True, cmap='coolwarm');

# рассмотрим диаграмму средней стоимости дома
fig = plt.subplots()
sns.countplot( x='median_house_value', data=df)
plt.show()

# рассмотрим диаграмму среднего дохода
fig = plt.subplots()
sns.countplot( x='median_income', data=df)
plt.show()

# рассмотрим диаграммы населения и среднего возраста жилья
fig = plt.subplots()
sns.countplot( x='housing_median_age', data=df)
plt.show()

fig = plt.subplots()
sns.countplot( x='population', data=df)
plt.show()

# как видим из графиков и выборки ниже, с возрастом жилья аналогичная ситуация с возрастом 52 - к нему отнесли все что старше или равно 52
df.groupby('housing_median_age').count()

df = df.loc[df['housing_median_age'] != 52]
df

# повторно потстроим матрицу корреляций
matrix_corr = df.corr();

# вывод корреляционной матрицы
sns.heatmap(matrix_corr, annot=True, cmap='coolwarm');

# рассмотрим диаграмму средней стоимости дома
fig = plt.subplots()
sns.countplot( x='median_house_value', data=df)
plt.show()

# рассмотрим диаграмму среднего дохода
fig = plt.subplots()
sns.countplot( x='median_income', data=df)
plt.show()

# рассмотрим диаграммы населения и среднего возраста жилья
fig = plt.subplots()
sns.countplot( x='housing_median_age', data=df)
plt.show()
fig = plt.subplots()
sns.countplot( x='population', data=df)
plt.show()

"""### Гипотеза №1
Средний уровень дохода влияет на среднюю стоимость жилья
"""

# рассмотрим показатели среднего уровня доходов относительно среднеей стоимости жилья
# и численности населения относительно среднего возраста жилья
fig, axes = plt.subplots(figsize=(20, 5), ncols=2)
sns.boxplot(ax=axes[0], x='median_house_value', y='median_income', data=df)
sns.boxplot(ax=axes[1], x='housing_median_age', y='population', data=df)
for i, ax in enumerate(fig.axes):
    axes[i].tick_params(axis='x', rotation=15)
plt.tight_layout()
plt.show()

# вычисляем коэффициент корреляции Пирсона между среднем уровнем доходов и средней стоимостью жилья
corr0 = df['median_income'].corr(df['median_house_value']);

# выводим результаты
print(f'Корреляция между среднем уровнем доходов и средней стоимостью жилья: {corr0:.3f}')

# строим график зависимости между среднем уровнем доходов и средней стоимостью жилья
sns.regplot(x='median_income', y='median_house_value', data=df)

# коэффициент корреляции Пирсона составляет 0.646, что позволяет сделать вывод о наличии связи между переменными
# (среднем уровнем доходов и средней стоимостью жилья)
# гипотеза подтверждена

"""### Гипотеза №2
Численность населения влияет на средний возраст жилья
"""

# строим график зависимости между численностью населения и среднем возрастом жилья
sns.regplot(x='population', y='housing_median_age', data=df)

# вычисляем коэффициент численностью населения и среднем возрастом жилья
corr0 = df['population'].corr(df['housing_median_age']);

# выводим результаты
print(f'Корреляция между численностью населения и среднем возрастом жилья: {corr0:.3f}')

# коэффициент корреляции Пирсона составляет -0.288, что позволяет сделать вывод об отсутствие линейной связи между переменными
# (численность населения и средний возраст жилья)
# гипотеза не подтверждена

"""## Выводы
таким образом, в ходе анализа одна из двух гипотез потвердиласть.

**гипотеза №1:**  
Средний уровень дохода влияет на среднюю стоимость жилья - **ПОДТВЕРДИЛАСЬ**.  
для проверки данной гипотезы был использован метод Пирсона (его показатель составил 0.646) и графики корреляции, которые указывают на наличие линейной между рассматриваемыми переменными

**гипотеза №2:**  
Численность населения влияет на средний возраст жилья - **НЕ ПОДТВЕРДИЛАСЬ**.  
для проверки данной гипотезы был использован метод Пирсона (его показатель составил -0.288) и графики корреляции, которые указывают на отсутствие линейной связи между рассматриваемыми переменными

## Проверка статистических гипотез
для того чтобы убедиться что корреляция существует в более широкой выборке, сформулируем две гипотезы (нулевую и альтернативную)  
H0 - это гипотеза, что корреляция в выборке нулевая (т.е. что измеренная корреляция целиком вызвана случайной ошибкой при отборе)  
H1 - это гипотеза, что корреляция в выборке не нулевая (не определяем направление корреляции, а только что она существует)
"""

def t_statistic(xs, ys):
    '''Вычисление t-статистики'''
    r = xs.corr(ys)
    df = xs.count() - 2 # степень свободы для проверки корреляции
    return r * np.sqrt(df / 1 - r ** 2)

xs = df['median_income']
ys = df['median_house_value']
t_value = t_statistic(xs, ys)

dfn = xs.count() - 2
p = 2 * stats.t.sf(t_value, dfn)  # функция выживания
#Значение функции выживания соответствует p-значению для односторонней проверки

f't-значение {t_value} p-значение {p}'

"""### Вывод по проверке статистических гипотез
P-значение настолько мало, что в сущности равно 0, означая, что шанс, что  улевая гипотеза является истинной, фактически не существует. Мы вынуждены  ринять альтернативную гипотезу о существовании корреляции.
"""

# дополнительно проверим интервал уверенности 95

def z_to_r(z):
    '''Преобразование z-оценки обратно в r-значение'''
    return (np.exp(z*2) - 1) / (np.exp(z*2) + 1)

def r_confidence_interval(crit, xs, ys):
    '''Расчет интервала уверенности
       для критического значения и данных'''
    r   = xs.corr(ys)
    n   = xs.count()
    zr  = 0.5 * np.log((1 + r) / (1 - r))
    sez = 1 / np.sqrt(n - 3)
    return (z_to_r(zr - (crit * sez))), (z_to_r(zr + (crit * sez)))

X = df['median_income']
y = df['median_house_value']
interval = r_confidence_interval(1.96, X, y)
f'Интервал уверенности (95%): {interval}'

# В результате получаем 95%-й интервал уверенности для ρ, расположенный между 0.623 и 0.667
# можем быть уверены в том, что в более широкой выборке существует достаточно сильная положительная корреляция